print("Завдання №3.3.\nПрограма виведення слів із введеного тексту на екран")
print("_" * 52, "\nЦя програма приймає введені користувачем тексти, які складються зі слів,\nі виводить на екран окремо"
                " кожне унікальне слово в алфавітному порядку."
                "\n\nПам'ятайте, що для припинення введення тексту необхідно ввести пустий рядок.\n"
                "Давайте розпочнемо...\n")


def text_input(string):  # Ф-ія видаляє знаки пунктуації із введеного тексту (крім дефісу всередині слів та апострофу)
    table = []           # і повертає список, складений із слів введеного тексту, який був отриманий в форматі str
    words = ['']         # При цьому слова, введені за кожної нової ітерації вводу, додаються до введених раніше
    while words:
        tran_table = str.maketrans("""!"#$%&()*+,./:;<=>?@[\\]^_`{|}~""", '                              ')
        words = input(string).replace(" - ", ' ').translate(tran_table).lower().split()
        table.extend(words)
    return table


r_button = True
while r_button:
    aw_list = list(set(text_input('Введіть текст: ')))          # Створює список із унікальних слів на основі тексту,
    aw_list.sort()                                              # отриманого від ф-ії введення text_input()

    print("\nУнікальні слова з введеного тексту, відсортовані за алфавітом: ")
    for i in range(len(aw_list)):
        print(aw_list[i])

    r_button = False if input('Закінчити роботу програми? (Y/y/Т/т): ').lower()[0] in ['y', 'т', 'д'] else True
