print("Программа обчислення площі прямокутника\n_______________________________________\n")
text = input("Зазначте одиниці, в яких будуть внесені величини сторін  (см, м, км): ")
a = int(input("Введіть цілочисленну довжину першої сторони: "))
b = int(input("Введіть цілочислнну довжину другої сторони: "))
c = a*b
print("------------------------------------------------------------------------")
print("Площа прямокутника зі сторонами", a, text, "та", b, text, "становить: ", c, text, end="")
print(2)
