print("Программа обчислення площі трикутника методом Герона\n____________________________________________________\n")
text = input("Зазначте одиниці, в яких будуть внесені величини сторін  (см, м, км): ")
a = int(input("Введіть цілочисленну довжину першої сторони: "))
b = int(input("Введіть цілочислнну довжину другої сторони: "))
c = int(input("Введіть цілочислнну довжину третьої сторони: "))
p = 0.5*(a+b+c)

#Нижче наведені три способи взяти корінь квадратний: фунцією sqrt() з підключенного модуля math, функцією pow()
# або оператором зведення в степінь **

import math
s = math.sqrt(p*(p-a)*(p-b)*(p-c))

#s = pow((p*(p-a)*(p-b)*(p-c)), 0.5)

#s = (p*(p-a)*(p-b)*(p-c))**0.5


print("------------------------------------------------------------------------")
print("Площа трикутника зі сторонами", a, text, ",", b, text, "та", c, text, "становить: ", s, text, end="")
print(2)
