print("Завдання №1.1\nПрограма для підрахунку кількості прожитих днів, місяців та років")
print("_" * 65)

user_first_name = input('Введіть ваше ім\'я: ')
user_last_name = input('Введіть ваше прізвище: ')

print(user_first_name, user_last_name, end="")
print(", вітаю Вас у цій простій  програмі! Давайте проведемо нескладні підрахунки.\n")
print("Наразі вам необхідно ввести деякі анкетні дані (якщо маєте бажання, то можете трішки прибріхати):")

day_of_birth = int(input('- В який день місяця ви народились? Введіть число від 1 до 31: '))
month_of_birth = int(input('- В який мясяць року ви народились? Введіть число від 1 до 12: '))
year_of_birth = int(input('- В який рік ви народились? Введіть число від 0 до 2020: '))


# Перевірка коректності введених даних
if day_of_birth < 1 or day_of_birth > 31 or month_of_birth < 1 or month_of_birth > 12 or year_of_birth < 0:
    print("Вам не вдалось правильно ввести анкетні дані. Спробуйте запустити програму ще раз. До зустрічі. :)")
    exit(0)
    # Пошук інформації підказав, що для дострокового завершення програми краще використовувати sys.exit()
    # але для цього необхідні підключення додаткових модулів, що є небажаним на даному етапі навчання
elif (year_of_birth == 2020 and month_of_birth != 1) or year_of_birth > 2020 or \
        (year_of_birth == 2020 and month_of_birth == 1 and day_of_birth > 10):
    print("Ви вказали дату народження, яка ще не настала. Можливо ви дійсно прилетіли з майбутнього, проте анкетні дані"
          " все одно введені некоректно.\nВам доведеться запустити програму ще раз. До зустрічі. :)")
    exit(0)
else:
    print("\nСхоже, що все чудово, поглянемо на результати обчислення:")


year_lived = ((2020*365 + 10) - (year_of_birth*365 + (month_of_birth-1)*30 + day_of_birth))//365
# Також працює year_lived = int(((2020*365 + 10) - (year_of_birth*365 + (month_of_birth-1)*30 + day_of_birth))/365)

# Звичайно, формулу обчислення прожитих років можна скоротити, прибираючи дужки і виконучи арифметичні дії над числами
# до різного ступеню спрощення. Можна дійти і до такого варіанту, який вказаний нижче:
# year_lived = int((737340 - year_of_birth*365 - month_of_birth*30 - day_of_birth)/365)
# І можна піти ще далі, проте навряд чи вже через тиждень у скороченій формулі розбереться навіть сам автор програми :)

month_lived = int((2020*12 + 10/30) - (year_of_birth*12 + (month_of_birth-1) + day_of_birth/30))
day_lived = (2020*365 + 10 - 5) - (year_of_birth*365 + (month_of_birth-1)*30 + day_of_birth)

# Спрощення кількості днів в місяці до 30 змушує нас вводити штучне коригування на '-5' для врахування
# невідповідності '12*30 = 360 та 365 ', що виникає для останньго року підрахунку. При цьому, в залежності від дати
# вашого народження може бути розходження розрахованої кількості днів з реальною, що обумовлене спрощенням, введеним в
# умові задачі


print("\nНа дату 10 січня 2020 року можна сказати, що:\n- кількість повних прожитих років складає", year_lived, end=";")
print("\n- кількість повних прожитих місяців складає", month_lived, "\n\nТобто, підводячи підсумки, маємо вказати, "
      "що кількість прожитих днів до дати початку курсів -", day_lived, end="")
print(",\nкількість повних прожитих місяців -", month_lived, end="")
print(", кількість повних прожитих років -", year_lived, "\nДо зустрічі,", user_first_name, user_last_name, end="!\n")
